# GetExternalDefinitionForElementId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeParameters..::..GetExternalDefinitionForElementId Method
RebarShapeParameters Class See Also
---
Seach a DefinitionFile for the ExternalDefinition corresponding to a parameter in a document.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalDefinition GetExternalDefinitionForElementId(
	Document doc,
	ElementId paramId,
	DefinitionFile definitionFile
)
```

Visual Basic
---
```text
Public Shared Function GetExternalDefinitionForElementId ( _
	doc As Document, _
	paramId As ElementId, _
	definitionFile As DefinitionFile _
) As ExternalDefinition
```

Visual C++
---
```text
public:
static ExternalDefinition^ GetExternalDefinitionForElementId(
	Document^ doc,
	ElementId^ paramId,
	DefinitionFile^ definitionFile
)
```

# ### Parameters
doc
    Type: Autodesk.Revit.DB..::..DocumentA document.
paramId
    Type: Autodesk.Revit.DB..::..ElementIdThe id of a shared parameter in the document.
definitionFile
    Type: Autodesk.Revit.DB..::..DefinitionFileA database of shared parameters.
# ### Return Value
The external parameter corresponding to the parameter's ElementId, or null if the Id does not correspond to an external parameter, or the parameter is not in the definition file.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was nullNothingnullptra null reference (Nothing in Visual Basic). |

# See Also
RebarShapeParameters Class
Autodesk.Revit.DB.Structure Namespace